# Formulae
bat
ca-certificates
deno
eza
fd
fzf
git
gh
jq
lazygit
neovim
ripgrep
ripgrep-all
starship
sdkman-cli
stow
tmux
tree-sitter
volta
wget
yazi
zoxide
zsh-autosuggestions
zsh-syntax-highlighting

# Casks
aerospace
arc
betterdisplay
caffeine
docker
dropbox
flux
font-fira-code-nerd-font
font-symbols-only-nerd-font
ghostty
hiddenbar
jetbrains-toolbox
ngrok
notion
obsidian
postman
raycast
visual-studio-code
webtorrent
