# Formulae
atuin
bat
borders
ca-certificates
carapace
cmake
codex
eza
fd
fzf
gh
git
jq
lazygit
lua
neovim
nushell
ripgrep
ripgrep-all
sdkman-cli
showkey
sketchybar
sqlite
starship
stow
tree-sitter
unar
unbound
volta
wget
yazi
zoxide
zsh-autosuggestions
zsh-syntax-highlighting

# Casks
aerospace
betterdisplay
caffeine
docker
docker-desktop
dropbox
flux-app
font-fira-code-nerd-font
font-hack-nerd-font
font-jetbrains-mono-nerd-font
font-sf-mono
font-sf-pro
font-sketchybar-app-font
font-symbols-only-nerd-font
frame0
ghostty
github
jetbrains-toolbox
karabiner-elements
ngrok
notion
notion-calendar
notion-mail
postman
raycast
thebrowsercompany-dia
visual-studio-code
vlc
webtorrent
