# Brewfile for dotfiles bootstrap
# Install with: brew bundle --file ./Brewfile

# --- Formulae ---
brew "atuin"
brew "bat"
brew "borders"
brew "btop"
brew "ca-certificates"
brew "carapace"
brew "cmake"
brew "diffnav"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "install-nothing"
brew "jq"
brew "lazydocker"
brew "lazygit"
tap "Adembc/homebrew-tap"
brew "lazyssh"
brew "lua"
brew "mise"
brew "mosh"
brew "neovim"
brew "opencode"
brew "posturr"
brew "ripgrep"
brew "ripgrep-all"
brew "sdkman-cli"
brew "showkey"
brew "sqlite"
brew "starship"
brew "stow"
brew "tree-sitter"
brew "treemd"
brew "unar"
brew "unbound"
brew "usage"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Casks ---
cask "aerospace"
cask "alt-tab"
cask "betterdisplay"
cask "caffeine"
cask "docker-desktop"
cask "dropbox"
cask "flux-app"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"

cask "frame0"
cask "ghostty"
cask "jetbrains-toolbox"
cask "hiddenbar"
cask "karabiner-elements"
cask "kindavim"
cask "libreoffice"
cask "motionik"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "obs"
cask "postman"
cask "raycast"
cask "scrolla"
cask "steipete/tap/codexbar"
cask "thaw"
cask "tor-browser"
tap "updatest/tap" "https://github.com/updatest/tap.git"
cask "updatest"
cask "vlc"
cask "webtorrent"
cask "wooshy"
cask "zed"
cask "zen"
