# Brewfile for dotfiles bootstrap
# Install with: brew bundle --file ./Brewfile

# --- Formulae ---
brew "atuin"
brew "bat"
brew "borders"
brew "btop"
brew "ca-certificates"
brew "carapace"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diffnav"
brew "docker"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "herdr"
brew "install-nothing"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
tap "Adembc/homebrew-tap"
brew "lazyssh"
brew "lua"
brew "mas"
brew "mise"
brew "mosh"
brew "neovim"
brew "opencode"
brew "ripgrep"
brew "ripgrep-all"
brew "rtk"
brew "scrcpy"
brew "sdkman-cli"
brew "showkey"
brew "sqlite"
brew "starship"
brew "stow"
tap "thgrace/redis-cli"
brew "thgrace/redis-cli/redis-cli"
brew "huseyinbabal/tap/tredis"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "treemd"
brew "unar"
brew "unbound"
brew "usage"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Casks ---
cask "aerospace"
cask "alt-tab"
cask "amical"
cask "antigravity"
cask "antigravity-cli"
cask "betterdisplay"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "dropbox"
cask "flux-app"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"

cask "frame0"
cask "ghostty"
cask "google-gemini"
cask "jetbrains-toolbox"
cask "helium-browser"
cask "hiddenbar"
cask "itsycal"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kindavim"
cask "libreoffice"
cask "sw33tlie/macshot/macshot"
cask "mitmproxy"
cask "motionik"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "obs"
cask "obsidian"
cask "postman"
cask "puremac"
cask "raycast"
cask "scrolla"
cask "steipete/tap/codexbar"
cask "thaw"
cask "tor-browser"
cask "vlc"
cask "wallspace"
cask "webtorrent"
cask "wooshy"
cask "zed"
cask "zen"

# --- Mac App Store ---
mas "Bitwarden", id: 1352778147
mas "DaVinci Resolve", id: 571213070
mas "Gapplin", id: 768053424
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "SocialFocus", id: 1661093205
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "uBlock Origin Lite", id: 6745342698
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
